# 1. Устанавливаем необходимый фундамент которое нужно для нашего app
FROM openjdk:17-jdk-slim

# 2. Устанавливаем рабочую папку внутри будущего образа
WORKDIR /app

# 3. Копируем jar-файл в будущий образ в папку /app и переименовываем его в app.jar
COPY target/weldproject-0.0.1-SNAPSHOT.jar app.jar

# 4. Открываем порт 8080 (если твой Spring Boot слушает 8080)
EXPOSE 8080

# 5. Указываем команды которые будут выполнены после запуска контейнера этого образа 
ENTRYPOINT ["java", "-jar", "app.jar"]
  

